[
    {
        "severity": "4",
        "regex": "\\*\\*\\*\\*\\s+leaked\\s+\\*\\*\\*\\*\n",
        "error_short": "**** leaked ****",
        "error_description": "You have a leak. A leak is a hole in your map that exposes any entity in your map to the void (the black space outside your map).",
        "error_solution": "Find and fix the leak. A map must be completely internally sealed and there must be no entity origins outside of the map. Displacements and brush entities do not seal a map, you must use worldbrushes. In Hammer: 'Map' -> 'Load Pointfile' and follow the red line the in the 3D View until you find the hole. There may be multiple holes, so you may need to do this multiple times.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Leak"
        ]
    },
    {
        "severity": "5",
        "regex": "AllocatedLightmap\\:\\s+lightmap\\s+too\\s+big\\s+to\\s+fit\\s+in\\s+page\n",
        "error_short": "AllocatedLightmap: lightmap too big to fit in page",
        "error_description": "A lightmap is a texture generated by VRAD and applied to world brush faces to simulate lighting. A lightmap can have multiple pages, which have a maximum size. Something caused this lightmap to explode in size, crashing VRAD.",
        "error_solution": "Check the lightmap scale of all brush (and displacement) faces in your level. Hammer's '3D View' -> '3D Lightmap Grid' will display different lightmap sizes in different colors, which may make this easier. If that does not help, use visgroups and cordons to find the problematic face. Experience shows this error is most often caused by large displacements.",
        "error_references": [
			"https://developer.valvesoftware.com/wiki/Lightmap"
        ]
    },
    {
        "severity": "5",
        "regex": "bmodel\\s+([\\d\\.,-]+)\\s+has\\s+no\\s+head\\s+node\\s+\\(class\\s+'([\\w\\/\\\\_\\-\\.]+)',\\s+targetname\\s+'([\\w\\/\\\\_\\-\\.]+)'\\)\n",
        "error_short": "bmodel [sub:1] has no head node (class '[sub:2]', targetname '[sub:3]')",
        "error_description": "A [sub:2] should be brush-based, but doesn't have a brush tied to it. This can happen for instance when you tie the brushes of this entity to another entity in 'Ignore groups'-mode.",
        "error_solution": "Find the entity and delete it. In Hammer: 'Map' -> 'Entity Report' and search for the targetname or classname.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/[sub:2]",
			"https://developer.valvesoftware.com/wiki/Hammer_Entity_Report_Dialog"
        ]
    },
    {
        "severity": "3",
        "regex": "brush\\s+([\\d\\.,-]+)\\s+,\\s+side\\s+([\\d\\.,-]+)\\:\\s+duplicate\\s+plane\n",
        "error_short": "brush [sub:1], side [sub:2]: duplicate plane",
        "error_description": "This error means you have a brush with coplanar planes (a.k.a. an invalid brush). simply put, two sides of the same brush aren't allowed to be on the same plane. It is most often caused by improper use of the vertex tool.",
        "error_solution": "The fix is to repair the brush, by either merging the two brushsides or moving them so they aren't on the same plane anymore. You can find the brush using 'View' -> 'Go To Brush Number...' ([sub:1]). You may also be able to spot the brush in Hammer's error finder (ALT+P).",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Invalid_brush"
        ]
    },
    {
        "severity": "5",
        "regex": "Brush\\s+([\\d\\.,-]+)\\s+\\:\\s+bounds\\s+out\\s+of\\s+range\n",
        "error_short": "Brush [sub:1]: bounds out of range",
        "error_description": "Your map is too big (you have brush(es) too close to the edge of the grid) or you have invalid brushes.",
        "error_solution": "Find the brush by going to 'View' -> 'Go To Brush Number...' ([sub:1]). This may not always give you the offending brush though. If the problem-checker in Hammer (ALT+P) doesn't find any offending brush(es) either, and you can't see brushes near the edge of the grid, you should use the cordon tools or visgroups to find them.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Invalid_brush"
        ]
    },
    {
        "severity": "3",
        "regex": "Brush\\s+([\\d\\.,-]+)\\:\\s+areaportal\\s+brush\\s+doesn't\\s+touch\\s+two\\s+areas\n",
        "error_short": "Brush [sub:1]: areaportal brush doesn't touch two areas",
        "error_description": "Also known as an areaportal leak. One of your areaportals touches either too many or too few areas. In most cases this is caused by the areaportal not properly sealing off two areas from each other. It may also be caused by two or more areaportals intersecting each other. Note that VBSP transforms your areaportal brush into a single plane which separates the areas, so consider this when setting up areaportals.",
        "error_solution": "The fix would be to move your areaportal(s) around so the above situations don't occur. Make sure they are aligned to the grid and don't intersect with each other or with any worldbrushes (brush entities other than areaportals are fine). You may need to read up on the usage of areaportals if you don't understand the problem. You can try finding the faulty areaportal via 'View' -> 'Go To Brush Number...' ([sub:1]), but this may actually point to a different, completely unrealted areaportal in the same area.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Areaportal"
        ]
    },
    {
        "severity": "5",
        "regex": "Brush\\s+([\\d\\.,-]+)\\:\\s+FloatPlane\\:\\s+bad\\s+normal\\s+Side\\s+([\\d\\.,-]+)\\s+Texture\\:\\s+([\\w\\/\\\\_\\-\\.]+)\n",
        "error_short": "Brush [sub:1]: FloatPlane: bad normal Side [sub:2] Texture: [sub:3]",
        "error_description": "One of your brushes has a face with a bad normal (a 'normal' is a orientation of a texture on a face).",
        "error_solution": "First see if the problemchecker in Hammer (ALT+P) can find and fix it. If it can't, find the brush and fix it manually (usually it's best to delete it and start all over) or select the brush and 'align to face' it in the Texture Tool. You can find the brush using 'View' -> 'Go To Brush Number...' ([sub:1]) The specific brushside will be textured with [sub:3], though that may be multiple sides.",
        "error_references": [
        ]
    },
    {
        "severity": "5",
        "regex": "Brush\\s+([\\d\\.,-]+)\\:\\s+MAX_MAP_BRUSHSIDES\n",
        "error_short": "Brush [sub:1]: MAX_MAP_BRUSHSIDES",
        "error_description": "You have too many brushsides in your map. The mentioned brush is simply the first one that didn't fit in the buffer. The exact limit depends on your Source Engine branch, but is typically 32768.",
        "error_solution": "Reduce the number of brushsides (or brushes) in your map. Replace brushwork with models, merge brushes together, use less complex geometry. Note that this error will not usually go away just by deleting the brush mentioned in the error. VBSP stops counting brushsides once it reaches the limit, so you will need to check Hammer ('Map' -> 'Show Information') for the exact number (which may also not be accurate if you are using Instances).",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Brush"
        ]
    },
    {
        "severity": "5",
        "regex": "Brush\\s+([\\d\\.,-]+)\\:\\s+MAX_MAP_PLANES\\s+Side\\s+([\\d\\.,-]+)\\s+Texture\\:\\s+Not\\s+a\\s+Parse\\s+error\\!\n",
        "error_short": "Brush [sub:1]: MAX_MAP_PLANES Side [sub:2] Texture: Not a Parse error!",
        "error_description": "You have too many planes (a plane is a surface from which brushsides are cut) in your map. The mentioned brush is simply the first one that didn't fit in the buffer. The exact limit depends on your Source Engine branch, but is typically 65536.",
        "error_solution": "Reduce the number of planes (or brushsides, or brushes) in your map. Replace brushwork with models, merge brushes together, use less complex geometry. Note that this error will not usually go away just by deleting the brush mentioned in the error. VBSP stops counting planes once it reaches the limit, so you will need to check Hammer ('Map' -> 'Show Information') for the exact number of faces (which may also not be accurate if you are using Instances).",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Brush"
        ]
    },
    {
        "severity": "5",
        "regex": "Brush\\s+([\\d\\.,-]+)\\:\\s+MAX_MAP_PLANES\\s+Side\\s+([\\d\\.,-]+)\\s+Texture\\:\\s+([\\w\\/\\\\_\\-\\.]+)\n",
        "error_short": "Brush [sub:1]: MAX_MAP_PLANES Side [sub:2] Texture: [sub:3]",
        "error_description": "You have too many planes (a plane is a surface from which brushsides are cut) in your map. The mentioned brush is simply the first one that didn't fit in the buffer. The exact limit depends on your Source Engine branch, but is typically 65536.",
        "error_solution": "Reduce the number of planes (or brushsides, or brushes) in your map. Replace brushwork with models, merge brushes together, use less complex geometry. Note that this error will not usually go away just by deleting the brush mentioned in the error. VBSP stops counting planes once it reaches the limit, so you will need to check Hammer ('Map' -> 'Show Information') for the exact number of faces (which may also not be accurate if you are using Instances). A plane is made up of two faces.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Brush"
        ]
    },
    {
        "severity": "3",
        "regex": "Brush\\s+([\\d\\.,-]+)\\:\\s+no\\s+visible\\s+sides\\s+on\\s+brush\n",
        "error_short": "Brush [sub:1]: no visible sides on brush",
        "error_description": "One of your brushes has no visible sides, likely caused by an invalid brush. This may possibly also be caused caused by mixing certain tool and non-tool textures.",
        "error_solution": "Try Hammer's problemchecker (ALT+P) to find and fix it 'View' -> 'Go To Brush Number...' ([sub:1]), otherwise you will have to find the brush yourself. Once you have found it, delete it or (carefully) use the Vertex Tool to fix it.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Invalid_brush"
        ]
    },
    {
        "severity": "5",
        "regex": "Brush\\s+([\\d\\.,-]+)\\:\\s+nummapbrushes\\s+\\=\\=\\s+MAX_MAP_BRUSHES\\s+Side\\s+([\\d\\.,-]+)\\s+Texture\\:\\s+([\\w\\/\\\\_\\-\\.]+)\n",
        "error_short": "Brush [sub:1]: nummapbrushes == MAX_MAP_BRUSHES Side [sub:2] Texture: [sub:3]",
        "error_description": "You have too many brushes in your map. The mentioned brush is simply the first one that didn't fit in the buffer. The exact limit depends on your Source Engine branch, but is typically 8192 (16384 in Garry's Mod).",
        "error_solution": "Reduce the number of brushes in your map. Replace brushwork with models, merge brushes together, use less complex geometry. Note that this error will not usually go away just by deleting the brush mentioned in the error. VBSP stops counting brushes once it reaches the limit, so you will need to check Hammer ('Map' -> 'Show Information') for the exact number of solids (which may also not be accurate if you are using Instances).",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Brush"
        ]
    },
    {
        "severity": "5",
        "regex": "Brush\\s+([\\d\\.,-]+)\\:\\s+num_entities\\s+\\=\\=\\s+MAX_MAP_ENTITIES\\s+Side\\s+([\\d\\.,-]+)\\s+Texture\\:\\s+([\\w\\/\\\\_\\-\\.]+)\n",
        "error_short": "Brush [sub:1]: num_entities == MAX_MAP_ENTITIES Side [sub:2] Texture: [sub:3]",
        "error_description": "You have too many entities in your map. The mentioned entity is simply the first one that didn't fit in the buffer. The exact limit depends on your Source Engine branch, but is typically 8192.",
        "error_solution": "The most common cause of this error is too many Detail Props - reduce the amount of surfaces the use them. If this doesn't solve the issue, use fewer props, overlays, or cubemaps. Note that even if this error is gone, you may still have edict limit issues in-game.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Entity_limit",
			"https://developer.valvesoftware.com/wiki/Category:Internal_entities",
			"https://developer.valvesoftware.com/wiki/Edict_t"
        ]
    },
    {
        "severity": "5",
        "regex": "brush\\s+([\\d\\.,-]+)\\:\\s+origin\\s+brushes\\s+not\\s+allowed\\s+in\\s+world\n",
        "error_short": "brush [sub:1]: origin brushes not allowed in world",
        "error_description": "For some deranged reason you are using a Goldsrc method to set the origin of a brush entity in a Source Engine map, and failed to use the ORIGIN texture on all sides of that origin brush.",
        "error_solution": "Simply replace the offending ORIGIN textures. Find the brush using 'View' -> 'Go To Brush Number...' ([sub:1]). On a side note, if you turn on helpers (the diamond shaped button in the right, top bar) you can specify an origin without the use of origin-brushes. much easier and safer. The origin-brush is just there for compatibility with hl1 maps, there is absolutely no reason for you to use this method at all.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Tool_textures_(GoldSrc)",
			"https://developer.valvesoftware.com/wiki/Tool_textures_(Source)"
        ]
    },
    {
        "severity": "5",
        "regex": "Brush\\s+([\\d\\.,-]+)\\:\\s+ParseDispInfoChunk\\:\\s+nummapdispinfo\\s+\\>\\s+MAX_MAP_DISPINFO\\s+Side\\s+([\\d\\.,-]+)\\s+Texture\\:\\s+([\\w\\/\\\\_\\-\\.]+)\n",
        "error_short": "Brush [sub:1]: ParseDispInfoChunk: nummapdispinfo > MAX_MAP_DISPINFO Side [sub:2] Texture: [sub:3]",
        "error_description": "You have too many/too large displacements.",
        "error_solution": "Destroy, or simplify, some of your displacements. Start with Power of 4 displacements, if you have any, which are most error-prone.",
        "error_references": [
        ]
    },
    {
        "severity": "2",
        "regex": "Brush\\s+([\\d\\.,-]+)\\:\\s+WARNING,\\s+microbrush\n",
        "error_short": "Brush [sub:1]: WARNING, microbrush",
        "error_description": "One of your brushes is smaller than the smallest allowable brush-size. This size (when it will be warned about) is specified in the compiler, but can be changed (it's an option for VBSP, (-micro #) default is 1.0 cubic hammer units). This is unlikely to cause any issues in your map, but is indicative of messy brushwork that you may want to simplify or turn into props.",
        "error_solution": "Find the brush using 'View' -> 'Go To Brush Number...' in Hammer. Either delete it, or enlarge it, whatever you desire. If you need small brushes, you may be better of with models instead.",
        "error_references": [
        ]
    },
    {
        "severity": "1",
        "regex": "Can't\\s+load\\s+skybox\\s+file\\s+([\\w\\/\\\\_\\-\\.]+)\\s+to\\s+build\\s+the\\s+default\\s+cubemap\\!\n",
        "error_short": "Can't load skybox file [sub:1] to build the default cubemap!",
        "error_description": "The compiler cannot find or read the default skybox file. If you are building cubemaps yourself, this does not matter as you are making your own default cubemap. This error can almost always be ignored.",
        "error_solution": "Make sure there is at least one env_cubemap entity somewhere in your map and remember to compile with the enabled CUBEMAPS step in CompilePal before publishing your map.",
        "error_references": [
        ]
    },
    {
        "severity": "4",
        "regex": "ClipWinding\\:\\s+points\\s+exceeded\\s+estimate\n",
        "error_short": "ClipWinding: points exceeded estimate",
        "error_description": "Somehow you managed to have too many Displacement vertices in your map without reaching the Displacement limit (default: 2048, Gmod: 16384, CS:GO: 32768).",
        "error_solution": "Reduce the power (amount of vertices) of your displacements and split them up into multiple smaller ones.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Displacement"
        ]
    },
    {
        "severity": "0",
        "regex": "Compiling\\s+takes\\s+too\\s+long\n",
        "error_short": "Compiling takes too long",
        "error_description": "As you create bigger maps, the compile process will take longer and longer. You can prevent a lot of this by optimizing your map. By telling the compile tools what to ignore and how to work, you can seriously decrease the time needed to build your map.",
        "error_solution": "Optimize your map. Use func_detail and hints to speed up the compile process. Alternatively, you can use visgroups or cordon tools to only compile a part of your level. This is great for checking only a part of your level. Lastly, you can set vvis.exe and vrad.exe to [-fast], so they do a worse job (not for final compiles!) but much faster than before.",
        "error_references": [
			"https://developer.valvesoftware.com/wiki/Optimization/Level_Design"
        ]
    },
    {
        "severity": "3",
        "regex": "Could\\s+not\\s+find\\s+lights\\.rad\\s+in\\s+lights\\.rad\n",
        "error_short": "Could not find lights.rad in lights.rad",
        "error_description": "vrad.exe couldn't find lights.rad, a file used to determine which textures can emit light by themselves.",
        "error_solution": "Move to/make a new lights.rad in the right directory. You should search for the file in your mod's directory, most mods have one.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Lights.rad"
        ]
    },
    {
        "severity": "1",
        "regex": "Degenerate\\s+Triangle\n",
        "error_short": "Degenerate Triangle",
        "error_description": "A degenerate triangle is a triangle with no area. for instance, when two of its points are at the same place or all three on one line. This error generally affects displacements. It also seems to be used in collision data (for the displacements?)",
        "error_solution": "Find the triangle (using the coordinates, each set represents a vertex) and see if you can fix it (e.g. by moving one of the vertices, or deleting it. For displacements, you may need to destroy the displacement and start all over if you can't seem to fix it. It wont harm you if you leave it, but make sure the area doesn't look weird because of it. (holes in the displacements, overly stretched textures)",
        "error_references": [
        ]
    },
    {
        "severity": "0",
        "regex": "DispInfo_LoadDisplacements\\:\\s+dispcounts\\s+\\(([\\d\\.,-]+)\\s+and\\s+([\\d\\.,-]+)\\)\\s+don't\\s+match\n",
        "error_short": "DispInfo_LoadDisplacements: dispcounts ([sub:1] and [sub:1]) don't match",
        "error_description": "The game has done a miscount on the amount of displacements in your map. ",
        "error_solution": "Try deleting and recreating your displacements (one at a time or all of them at once), or copy/paste them to another map and back. It seems to be caused by one or more displacements that haven't been saved properly to the mapfile. Hammer's Problem Checker (ALT+P) might pick up something as well.",
        "error_references": [
        ]
    },
    {
        "severity": "5",
        "regex": "Displacement\\s+([\\d\\.,-]+)\\s+has\\s+bad\\s+geometry\\s+near\\s+([\\d\\.,-]+)\\s+([\\d\\.,-]+)\\s+([\\d\\.,-]+)\\s+Can't\\s+compile\\s+displacement\\s+physics,\\s+exiting\\.\\s+Texture\\s+is\\s+([\\w\\/\\\\_\\-\\.]+)\n",
        "error_short": "Displacement [sub:1] has bad geometry near [sub:2] [sub:3] [sub:4]. Can't compile displacement physics, exiting. Texture is [sub:5]",
        "error_description": "One of your displacements has gone bad, your awesome reshaping of one of them has caused it to become so complicated vbsp is unable to determine its collisions.",
        "error_solution": "Although you can try to salvage your displacement by reshaping it more, it is probably a better idea to destroy the displacement and recreate it. You can find the displacement by going to the coordinates [sub:2] [sub:3] [sub:4] ('View' -> 'Go To Coordinates...') and looking for a displacement with the [sub:5] texture.",
        "error_references": [
        ]
    },
    {
        "severity": "4",
        "regex": "Ed_alloc\\:\\s+no\\s+free\\s+edicts\n",
        "error_short": "Ed_alloc: no free edicts",
        "error_description": "You have too many entities in your map. The exact limit depends on your Source Engine branch, but is typically 8192.",
        "error_solution": "The most common cause of this error is too many Detail Props - reduce the amount of surfaces the use them. If this doesn't solve the issue, use fewer props, overlays, or cubemaps. Note that even if this error is gone, you may still have edict limit issues in-game.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Entity_limit",
			"https://developer.valvesoftware.com/wiki/Category:Internal_entities",
			"https://developer.valvesoftware.com/wiki/Edict_t"
        ]
    },
    {
        "severity": "0",
        "regex": "Engine\\s+Error\\:\\s+([\\w\\/\\\\_\\-\\.]+)\\s+with\\s+no\\s+model\\s+at\\s+([\\d\\.,-]+)\\s+([\\d\\.,-]+)\\s+([\\d\\.,-]+)\n",
        "error_short": "Engine Error: [sub:1] with no model at [sub:2] [sub:3] [sub:4]",
        "error_description": "One of the brush-based entities in your map doesn't have any brushes tied to it.",
        "error_solution": "Find the entity in Hammer: 'Map' -> 'Entity Report'. Once found, either delete the entity or tie a (few) brush(es) to it. A brush-based entity without brushes tied to it is unlikely to do anything at all.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Brush_entity",
			"https://developer.valvesoftware.com/wiki/[sub:1]"
        ]
    },
    {
        "severity": "5",
        "regex": "Entity\\s+([\\d\\.,-]+)\\:\\s+func_areaportal\\s+can\\s+only\\s+be\\s+a\\s+single\\s+brush\n",
        "error_short": "Entity [sub:1]: func_areaportal can only be a single brush",
        "error_description": "Pretty obvious, a func_areaportal/func_areaportalwindow can only consist of one brush per entity.",
        "error_solution": "Make multiple brushes multiple func_areaportal(window)s, or make different windows in a wall the same areaportal(window). Note that areaportals are absolutely allowed to touch each other, they just must not intersect, and they must still separate exactly two areas from each other.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Areaportal"
        ]
    },
    {
        "severity": "4",
        "regex": "Entity\\s+([\\w\\/\\\\_\\-\\.]+)\\s+\\(([\\d\\.,-]+)\\s+([\\d\\.,-]+)\\s+([\\d\\.,-]+)\\)\\s+leaked\\!\n",
        "error_short": "Entity [sub:1] ([sub:2] [sub:3] [sub:4]) leaked!",
        "error_description": "You have a leak. A leak is a hole in your map that exposes any entity in your map to the void (the black space outside your map).",
        "error_solution": "Find and fix the leak. A map must be completely internally sealed and there must be no entity origins outside of the map. Displacements and brush entities do not seal a map, you must use worldbrushes. In Hammer: 'Map' -> 'Load Pointfile' and follow the red line the in the 3D View until you find the hole. There may be multiple holes, so you may need to do this multiple times.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Leak"
        ]
    },
    {
        "severity": "3",
        "regex": "Error\\s+loading\\s+studio\\s+model\\s+\"\"\\!\n",
        "error_short": "Error loading studio model \"\"!",
        "error_description": "You have an model-based entity (prop_something) without a model specified.",
        "error_solution": "To fix, delete it or give it a model. It can be hard to find, and if you really cant find it, use this trick:  open your map (.vmf) in wordpad, and search for the string",
        "error_references": [
            ""
        ]
    },
    {
        "severity": "2",
        "regex": "Error\\s+loading\\s+studio\\s+model\\s+\"([^\"]+)\"\\!\n",
        "error_short": "Error loading studio model \"[sub:1]\"!",
        "error_description": "You have used the wrong model with the wrong entity, or there is another reason the model couldn't be loaded, like an invalid location, errors in the file etc.",
        "error_solution": "Either change the model, or the entity (eg. like it says in the error, use a prop_physics, prop_dynamic or prop_physics_multiplayer) or whatever the compiler tells you you should use). Just as a thumb rule:-anything that can be picked up is prop_dynamic or prop_physics(_multiplayer)-anything that is completely static is prop_static (you may also recognise these with invisible backsides)-anything with dynamic shapes (eg. bodies, matrasses) is prop_ragdoll. There are exceptions, as allways. The GUI model browser shows you exactly what types of entity a model is suited for. You can find the entity with the offending model in Hammer: 'Map' -> 'Entity Report'. Enter for Key 'model' and for Value '[sub:1]'.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Prop_Types_Overview"
        ]
    },
    {
        "severity": "0",
        "regex": "Error\\s+opening\\s+mapname\\.bsp\n",
        "error_short": "Error opening mapname.bsp",
        "error_description": "The game couldn't open your map. Did you recieve any errors in the compile process? Got your paths set up right? Maybe your map is empty? The game can only open your map if vbsp.exe successfully created a BSP file from your Map VMF.",
        "error_solution": "Check your compile log for any other errors and fix those.",
        "error_references": [
			"https://developer.valvesoftware.com/wiki/Map_Compiling_Theory"
        ]
    },
    {
        "severity": "4",
        "regex": "Error\\s+trying\\s+to\\s+allocate\\s+([\\d\\.,-]+)\\s+bytes\n",
        "error_short": "Error trying to allocate [sub:1] bytes",
        "error_description": "Vrad.exe did not have enough memory to finish its task. There are two causes: 1) You are running low on memory (RAM + Pagefile). 2) Vrad.exe is choking on some very complicated bit of your map, causing it to ask for a lot of memory which doesn't exist. This issue occurs most often with very large, very open maps, or particularly detailed ones with many lightmaps.",
        "error_solution": "If you are running low on free memory (check Task Manager) try increasing the pagefile if you aren't letting Windows take care of it. If not, use cordon tools to isolate the problemarea in your map (might be a broken brush, or simply too complex geometry) and see what you can do to fix it. Consider reducing lightmap resolution on larger surfaces or complex objects. Try running VRAD only in LDR or HDR, as using -both will require (almost) double the memory.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/VRAD",
			"https://developer.valvesoftware.com/wiki/VRAD_HDR_Crash_Fix"
        ]
    },
    {
        "severity": "5",
        "regex": "Error\\!\\s+entity\\s+sky_camera\\s+in\\s+solid\\s+volume\\!\n",
        "error_short": "Error! entity sky_camera in solid volume!",
        "error_description": "Either you have placed your sky_camera in a brush, or your map has a leak.",
        "error_solution": "Use entity report to find the sky_camera and move it, or in case of a leak, fix the leak.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Sky_camera"
        ]
    },
    {
        "severity": "2",
        "regex": "Error\\!\\s+prop_static\\s+using\\s+model\\s+\"([^\"]+)\",\\s+which\\s+must\\s+be\\s+used\\s+on\\s+a\\s+dynamic\\s+entity\\s+\\(i\\.e\\.\\s+prop_physics\\)\\.\\s+Deleted\\.\n",
        "error_short": "Error! prop_static using model \"[sub:1]\", which must be used on a dynamic entity (i.e. prop_physics). Deleted.",
        "error_description": "You have used the wrong model with the wrong entity, or there is another reason the model couldn't be loaded, like an invalid location, errors in the file etc.",
        "error_solution": "Either change the model, or the entity (eg. like it says in the error, use a prop_physics, prop_dynamic or prop_physics_multiplayer) or whatever the compiler tells you you should use). Just as a thumb rule:-anything that can be picked up is prop_dynamic or prop_physics(_multiplayer)-anything that is completely static is prop_static (you may also recognise these with invisible backsides)-anything with dynamic shapes (eg. bodies, matrasses) is prop_ragdoll. There are exceptions, as allways. The GUI model browser shows you exactly what types of entity a model is suited for. You can find the entity with the offending model in Hammer: 'Map' -> 'Entity Report'. Enter for Key 'model' and for Value '[sub:1]'.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Prop_Types_Overview"
        ]
    },
    {
        "severity": "5",
        "regex": "Error\\!\\s+Too\\s+many\\s+detail\\s+props\\s+emitted\\s+on\\s+this\\s+map\\!\n",
        "error_short": "Error! Too many detail props emitted on this map!",
        "error_description": "The amount of detail props (the grasses and such that automatically appear on displacements with certain textures) has exceeded the maximum number of allowable detail props (default: 65535).",
        "error_solution": "Either reduce the amount of textures/displacements which cause these props to appear, or edit the texture's vmt's to decrease the number of detail props those textures emit. Most stock materials should already have a NODETAIL variant that will not spawn detail props.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Detail_props"
        ]
    },
    {
        "severity": "5",
        "regex": "Error\\:\\s+displacement\\s+found\\s+on\\s+a\\(n\\)\\s+([\\w\\/\\\\_\\-\\.]+)\\s+entity\\s+-\\s+not\\s+supported\n",
        "error_short": "Error: displacement found on a(n) [sub:1] entity - not supported",
        "error_description": "You have tied a displacement to an entity. Displacements cannot be entities. Not func_detail, not anything else.",
        "error_solution": "Find your displacement and de-entify it. The easiest method to find it in a big map is to select all displacements at once (select the 'Displacements' visgroup (in the visgroup-window to the right in Hammer), then press 'Mark') while in 'Ignore Groups' mode (button 'IG' in the top bar). Now tie all of the displacements to an entity, and 'To World' them back again right after that while they are still selected. If that did not work, find the offending brush entity via 'Map' -> 'Entity Report' -> '[sub:1]",
        "error_references": [
        ]
    },
    {
        "severity": "5",
        "regex": "Error\\:\\s+displacement\\s+found\\s+on\\s+a\\(n\\)\\s+([\\w\\/\\\\_\\-\\.]+)\\s+entity\\s+-\\s+not\\s+supported\\s+\\(entity\\s+([\\d\\.,-]+),\\s+brush\\s+([\\d\\.,-]+)\\)\n",
        "error_short": "Error: displacement found on a(n) [sub:1] entity - not supported (entity [sub:2], brush [sub:3])",
        "error_description": "You have tied a displacement to an entity. Displacements cannot be entities. Not func_detail, not anything else.",
        "error_solution": "Find your displacement and de-entify it. The easiest method to find it in a big map is to select all displacements at once (select the 'Displacements' visgroup (in the visgroup-window to the right in Hammer), then press 'Mark') while in 'Ignore Groups' mode (button 'IG' in the top bar). Now tie all of the displacements to an entity, and 'To World' them back again right after that while they are still selected. If that did not work, find the offending brush entity via 'Map' -> 'Entity Report' -> '[sub:1]",
        "error_references": [
        ]
    },
    {
        "severity": "2",
        "regex": "Error\\:\\s+material\\s+([\\w\\/\\\\_\\-\\.]+)\\s+doesn't\\s+have\\s+a\\s+\\$bottommaterial\n",
        "error_short": "Error: material [sub:1] doesn't have a $bottommaterial",
        "error_description": "You've tried to use a water texture which should only be placed in the map automatically by the compiler, or the water-texture you did use has an invalid bottom-texture. Invalid materials usually end in _beneath or _bottom or _dx* .",
        "error_solution": "There will be a matching texture without those suffixes which you can use instead. Try another water texture.",
        "error_references": [
            "https://statecouncil.github.io/tf-bamf/water-info-sheet.html"
        ]
    },
    {
        "severity": "5",
        "regex": "Face\\s+List\\s+Count\\s+\\>\\=\\s+OVERLAY_BSP_FACE_COUNT\n",
        "error_short": "Face List Count >= OVERLAY_BSP_FACE_COUNT",
        "error_description": "One of your info_overlays is spanning more faces than the maximum (default: 64). This number is based on the faces after bsp cutting, so it might look alright in Hammer but doesn't work in game. This can also be caused by an overlay that is applied to a very large brush or a brush that has a very low lightmap scale.",
        "error_solution": "Check each overlay in your map, and make sure it doesn't cover more than 64 faces. Allthough easier said than done, you must try to find the overlay in Hammer (where you can only guess where your faces are cut) so it is best to check big (stretched) overlays first, and also make sure you have no world brushes cutting each other up near these overlays (eg. near stairs, or when you use a small lightmap scale). The use of func_detail will stop that.If you have an overlay that is applied to a very large brush, try cutting up the offending brush so it is not as large. Reset the overlay brush faces and recompile.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Info_overlay"
        ]
    },
    {
        "severity": "0",
        "regex": "fastvis\\s+\\=\\s+true\n",
        "error_short": "fastvis = true",
        "error_description": "You seem to be running vvis in -fast mode. This is okay for testing purposes, but mind that this will cause various visual issues and significantly lower performance than a full compile.",
        "error_solution": "If you experience any of these problems, and don't have any specific clues for the cause, please try to compile without the -fast option, see if that helps. If compiling without -fast is taking too long /seems to crash vvis, you may need to optimize your map using func_detail!",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Optimization/Level_Design"
        ]
    },
    {
        "severity": "5",
        "regex": "Find\\s+Visible\\s+Detail\\s+Sides\\.\\.\\.Bad\\s+detail\\s+brush\\s+side\n",
        "error_short": "Find Visible Detail Sides...Bad detail brush side",
        "error_description": "The cause for this error is using multiple (incompatible) tool-textures on the same brush, or so it seems. Apart from HINT and SKIP there aren't much combination of tool-textures allowed on the same brush, so any other combination is a possible cause. Tool-textures are the 'tools/' textures you can find using the texture browser in Hammer, and that have a special meaning.",
        "error_solution": "You will need to find the brush(es) with these tool-textures and replace those textures. The easiest way to find the source of the error is to hide all visgroups except for the visgroups which are for tools textures and then just look around the map in 3D Textured mode.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Tool_textures_(Source)"
        ]
    },
    {
        "severity": "3",
        "regex": "FindPortalSide\\:\\s+Couldn't\\s+find\\s+a\\s+good\\s+match\\s+for\\s+which\\s+brush\\s+to\\s+assign\\s+to\\s+a\\s+portal\\s+near\\s+\\(([\\d\\.,-]+)\\s+([\\d\\.,-]+)\\s+([\\d\\.,-]+)\\)\n",
        "error_short": "FindPortalSide: Couldn't find a good match for which brush to assign to a portal near ([sub:1] [sub:2] [sub:3])",
        "error_description": "Usually, this error is caused by a leak, so fix it, if so. If not, there is a (group of) brush(es) that is/are giving vbsp.exe a hard time to figure out your level. Apparently it cannot determine the boundaries of a certain portal. Maybe there is a large brush covering the area, maybe the area is just too complicated for poor vbsp to figure out.",
        "error_solution": "Find the given coordinates (or if a brush number is given search for the brush number) and see what you can do to to simplify the area (like turning brushes to func_detail). You should also check to see if the brushes are overlapping at any point.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Optimization/Level_Design"
        ]
    },
    {
        "severity": "1",
        "regex": "Found\\s+a\\s+displacement\\s+edge\\s+abutting\\s+multiple\\s+other\\s+edges\n",
        "error_short": "Found a displacement edge abutting multiple other edges",
        "error_description": "A displacement is touching more than one other displacements at the same point along one of its edges; in other words: at some point, three displacements are touching each other along an entire edge. This may cause lighting errors, as vrad doesn't know which displacements need to have their light smoothed out. If you have assembled your displacements this way on purpose, ignore this error.",
        "error_solution": "If there are any displacements with obvious bad lighting in-game, that might be your first clue. Otherwise, you may need to check all of your displacements by hand using visgroups and hiding/unhiding them.",
        "error_references": [
        ]
    },
    {
        "severity": "5",
        "regex": "HashVec\\:\\s+point\\s+outside\\s+valid\\s+range\n",
        "error_short": "HashVec: point outside valid range",
        "error_description": "Your map is too big (you have brush(es) too near to the edge of the grid) or you have invalid brushes.",
        "error_solution": "If the problem-checker in Hammer (ALT+P) doesn't find any offending brush(es), and you can't see brushes near the edge of the grid, you should use the cordon tools or visgroups to find them.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Invalid_brush"
        ]
    },
    {
        "severity": "0",
        "regex": "Host_EndGame\\:\\s+Map\\s+coordinate\\s+extents\\s+are\\s+too\\s+large\n",
        "error_short": "Host_EndGame: Map coordinate extents are too large",
        "error_description": "Your map is too big (you have brush(es) too near to the edge of the grid) or you have invalid brushes.",
        "error_solution": "If the problem-checker in Hammer (ALT+P) doesn't find any offending brush(es), and you can't see brushes near the edge of the grid, check suspicious or recently vertex-edited brushes first. If you still can't find anything, you should use the cordon tools or visgroups to find them.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Invalid_brush"
        ]
    },
    {
        "severity": "3",
        "regex": "KeyValues\\s+Error\\:\\s+RecursiveLoadFromBuffer\\:\\s+\\s+got\\s+.\\s+in\\s+key\\s+in\\s+file\\s+([\\w\\/\\\\_\\-\\.]+)\n",
        "error_short": "KeyValues Error: RecursiveLoadFromBuffer:  got [char] in key in file [sub:1]",
        "error_description": "There seems to be a parsing error in [sub:1]. Fix it if you want the texture or other resource associated with this file to work correctly.",
        "error_solution": "",
        "error_references": [
        ]
    },
    {
        "severity": "2",
        "regex": "KeyValues\\s+Error\\:\\s+RecursiveLoadFromBuffer\\:\\s+got\\s+EOF\\s+instead\\s+of\\s+keyname\\s+in\\s+file\\s+([\\w\\/\\\\_\\-\\.]+)\n",
        "error_short": "KeyValues Error: RecursiveLoadFromBuffer: got EOF instead of keyname in file [sub:1]",
        "error_description": "There was a problem parsing this texture ([sub:1]). Looks like you forgot to close a (couple of) brackets in this file? Or perhaps a string not closed with a \"?",
        "error_solution": "Find the file, open it, and fix it.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/VMT"
        ]
    },
    {
        "severity": "4",
        "regex": "Leaf\\s+\\(portal\\s+([\\d\\.,-]+)\\)\\s+with\\s+too\\s+many\\s+portals\\.\\s+Use\\s+vbsp\\s+-glview\\s+to\\s+compile,\\s+then\\s+glview\\s+-portal\\s+-portalhighlight\\s+X\\s+to\\s+view\\s+the\\s+problem\\.\n",
        "error_short": "Leaf (portal [sub:1]) with too many portals. Use vbsp -glview to compile, then glview -portal -portalhighlight X to view the problem.",
        "error_description": "One of your leafs is neighbouring too many other leafs. (the 'doorways' between leafs are called 'portals'). This causes vvis.exe to quit compiling your map.",
        "error_solution": "Find your leaf, and see if you can reduce the number of neighbouring leafs by adding world brushes or turning existing ones into func_detail (or clever placements of hints). Big leafs in the sky should also be avoided. While the error message suggests the use of GLview, you likely want to use the built-in method in Hammer instead: 'Map' -> 'Load Portal File'. Then find the most egregious clutter of blue and simplify/func_detail the geometry around it.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/VIS_optimization",
            "https://developer.valvesoftware.com/wiki/Visleaf",
            "https://developer.valvesoftware.com/wiki/Glview"
        ]
    },
    {
        "severity": "4",
        "regex": "Leaf\\s+([\\d\\.,-]+)\\s+\\(portal\\s+\\[portal_id\\]\\)\\s+with\\s+too\\s+many\\s+portals\\.\\s+Use\\s+vbsp\\s+-glview\\s+to\\s+compile,\\s+then\\s+glview\\s+-portal\\s+-portalhighlight\\s+X\\s+or\\s+-leafhighlight\\s+L\\s+to\\s+view\\s+the\\s+problem\\.\\s+\n",
        "error_short": "Leaf [sub:1] (portal [portal_id]) with too many portals. Use vbsp -glview to compile, then glview -portal -portalhighlight X or -leafhighlight L to view the problem. ",
        "error_description": "One of your leafs is neighbouring too many other leafs. (the 'doorways' between leafs are called 'portals'). This causes vvis.exe to quit compiling your map.",
        "error_solution": "Find your leaf, and see if you can reduce the number of neighbouring leafs by adding world brushes or turning existing ones into func_detail (or clever placements of hints). Big leafs in the sky should also be avoided. While the error message suggests the use of GLview, you likely want to use the built-in method in Hammer instead: 'Map' -> 'Load Portal File'. Then find the most egregious clutter of blue and simplify/func_detail the geometry around it.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/VIS_optimization",
            "https://developer.valvesoftware.com/wiki/Visleaf",
            "https://developer.valvesoftware.com/wiki/Glview"
        ]
    },
    {
        "severity": "4",
        "regex": "LoadPortals\\:\\s+couldn't\\s+read\\s+([\\w\\/\\\\_\\-\\.]+)\\.prt\n",
        "error_short": "LoadPortals: couldn't read [sub:1].prt",
        "error_description": "Vvis.exe cannot find the portalfile, a file that vbsp.exe creates which specifies the location of portals and leafs. Usually because of a leak or other fatal error (see further upwards in your log) in the vbsp process, but may also be because your directories are set up wrong.",
        "error_solution": "Check your logfile for other errors (mainly leaks), and/or check if you have your directories set up right.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Leak"
        ]
    },
    {
        "severity": "2",
        "regex": "make_triangles\\:calc_triangle_representation\\:\\s+Cannot\\s+convert\n",
        "error_short": "make_triangles:calc_triangle_representation: Cannot convert",
        "error_description": "This error is likely caused by certain models with broken or semi-broken geometry, including some stock Valve assets. It may also be caused by a broken displacement, which may lead to missing or broken collision in-game.",
        "error_solution": "If this error does not actually give you any trouble in-game and none of your playtesters are complaining, ignore it. As mentioned, even some Valve assets cause it. If there are coordinates given with it, check them out and make sure all displacements are working correctly, and then move on.",
        "error_references": [
        ]
    },
    {
        "severity": "5",
        "regex": "Map\\s+has\\s+too\\s+many\\s+texinfos\\s+\\(has\\s+([\\d\\.,-]+),\\s+can\\s+have\\s+at\\s+most\\s+12288\\)\n",
        "error_short": "Map has too many texinfos (has [sub:1], can have at most 12288)",
        "error_description": "Texinfos (Texture Information) describe the scaling, orientation, alignment and lightmap size of a given texture as applied to a brush face. Multiple faces can use the same texinfo, as long as their info is the same.",
        "error_solution": "Give multiple brush faces the same values. Reducing the amount of cubemaps may also help. Remember you an apply the same texture settings to multiple faces by selecting a face with Hammer's Texture Tool, then pressing ALT+MOUSE2 on a different face.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Applying_Textures"
        ]
    },
    {
        "severity": "2",
        "regex": "Material\\s+\"([^\"]+)\"\\s+not\\s+found\n",
        "error_short": "Material \"[sub:1]\" not found",
        "error_description": "The error is self-explanatory. Somewhere in your map you have referenced a texture that doesn't exist. Perhaps you used a texture from another modification or game you haven't correctly set your current game up for?",
        "error_solution": "Make sure you have your paths set up correctly and that all custom content is mounted correctly.",
        "error_references": [
        ]
    },
	{
        "severity": "2",
        "regex": "Material\\s+not\\s+found\\!\\:\\s+([\\w\\/\\\\_\\-\\.]+)\n",
        "error_short": "Material not found!: [sub:1]",
        "error_description": "The error is self-explanatory. Somewhere in your map you have referenced a texture that doesn't exist. Perhaps you used a texture from another modification or game you haven't correctly set your current game up for?",
        "error_solution": "Make sure you have your paths set up correctly and that all custom content is mounted correctly.",
        "error_references": [
        ]
    },
    {
        "severity": "1",
        "regex": "Material\\s+glass\\/glasswindowbreak070b\\s+is\\s+depending\\s+on\\s+itself\\s+through\\s+materialvar\\s+\\$crackmaterial\\!\n",
        "error_short": "Material glass/glasswindowbreak070b is depending on itself through materialvar $crackmaterial!",
        "error_description": "You shouldn't use this texture, but this one: glass/glasswindowbreak070a. The b-texture is used after the glass is broken, so you should never put it into your map manually. Sometimes this error occours and you dont have this texture anywhere in your map. Probably being some strange bug, might as wel leave it, it seems to cause no harm. ",
        "error_solution": "Use glass/glasswindowbreak070a instead.",
        "error_references": [
        ]
    },
    {
        "severity": "2",
        "regex": "Material\\s+([\\w\\/\\\\_\\-\\.]+)\\s+uses\\s+unknown\\s+detail\\s+object\\s+type\\s+([\\w\\/\\\\_\\-\\.]+)\\!\\s+\n",
        "error_short": "Material [sub:1] uses unknown detail object type [sub:2]! ",
        "error_description": "One of your textures is scripted to emit detail props (the grass thingies that appear on displacements), but the detail props specified are not defined in the mod's data files.",
        "error_solution": "Use a different detail sprites file. In Hammer: 'Map' -> 'Map Properties...' -> 'Detail .vbsp File' and select a different entry from the drop-down or type in your own. The default, 'detail_lakeside.vbsp' should be compatible with most materials.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Displacement_Grass",
			"https://developer.valvesoftware.com/wiki/Detail_props",
			"https://tf2maps.net/abs/detail_sprites_info.html"
        ]
    },
    {
        "severity": "0",
        "regex": "MaterialSystem_Interface_t\\:\\:AllocateLightmap\\s+\\:\\s+lightmap\\s+\\(([\\d\\.,-]+)x([\\d\\.,-]+)\\)\\s+too\\s+big\\s+to\\s+fit\\s+page\\s+\\(([\\d\\.,-]+)x([\\d\\.,-]+)\\)\n",
        "error_short": "MaterialSystem_Interface_t::AllocateLightmap : lightmap ([sub:1]x[sub:1]) too big to fit page ([sub:1]x[sub:1])",
        "error_description": "The exact cause of this error is hard to determine, but it likely has to do with displacement lighting.",
        "error_solution": "If there are any displacements with obvious bad lighting in-game, that might be your first clue. Otherwise, you may need to check all of your displacements by hand using visgroups and hiding/unhiding them.",
        "error_references": [
            ""
        ]
    },
    {
        "severity": "5",
        "regex": "MAX_MAP_MODELS\n",
        "error_short": "MAX_MAP_MODELS",
        "error_description": "You have too many brush-based entities (doors, func_breakable, trains, that sorta stuff). Func_detail is the only entity not counted.",
        "error_solution": "Use models instead, or reduce the amount of these entities.",
        "error_references": [
            ""
        ]
    },
    {
        "severity": "1",
        "regex": "MAX_TEXLIGHTS\n",
        "error_short": "MAX_TEXLIGHTS",
        "error_description": "Your lights.rad has too many entries (there is a maximum of 128 entries) the rest will be skipped. This error won't break anything, and the map will run fine.",
        "error_solution": "Take a look at your lights.rad file and see if you can reduce its content.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Lights.rad",
            "https://developer.valvesoftware.com/wiki/RAD_file"
        ]
    },
    {
        "severity": "1",
        "regex": "Memory\\s+leak\\:\\s+mempool\\s+blocks\\s+left\\s+in\\s+memory\\:\\s+([\\d\\.,-]+)\n",
        "error_short": "Memory leak: mempool blocks left in memory: [sub:1]",
        "error_description": "These warnings can be completely ignored, they have nothing to do with your map (but with crappy programming by Valve!).",
        "error_solution": "Become a Valve programmer and fix the problem. ",
        "error_references": [
            "https://www.valvesoftware.com/jobs"
        ]
    },
    {
        "severity": "1",
        "regex": "Multiple\\s+references\\s+for\\s+cubemap\\s+on\\s+texture\\s+([\\w\\/\\\\_\\-\\.]+)\\!\\!\\!\n",
        "error_short": "Multiple references for cubemap on texture [sub:1]!!!",
        "error_description": "You can specify for each cubemap which faces should be using it. However, each face can only have one cubemap attached to itself this way. If you want the face to use multiple cubemaps you shouldn't tie them statically to cubemaps this way, but split the face (into multiple brushes). Note that this error won't break anything, the brush face will simply default to one of the two cubemaps.",
        "error_solution": "Check your env_cubemap entities until you find two that reference the same face. If it doesn't cause any visual issues, ignore it.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Env_cubemap"
        ]
    },
    {
        "severity": "3",
        "regex": "no\\s+samples\\s+x\n",
        "error_short": "no samples x",
        "error_description": "Vrad.exe is freaking out over some part of geometry in your map. Did you recently add any complicated/oddshaped brushes?",
        "error_solution": "Find the brush(es) vrad doesn't like and remove or fix them. See if Hammer's problem checker (alt+p) turns up anything.",
        "error_references": [
            ""
        ]
    },
    {
        "severity": "0",
        "regex": "No\\s+such\\s+variable\\s+\"\\$hdrbasetexture\"\\s+for\\s+material\\s+\"([^\"]+)\"\n",
        "error_short": "No such variable \"$hdrbasetexture\" for material \"[sub:1]\"",
        "error_description": "You have used a non-HDR skybox texture, while the compile tools expect a HDR skybox instead.",
        "error_solution": "Either make a HDR skybox, change your skybox to a HDR one or ignore this error. See below for a detailed fix.",
        "error_references": [
            "https://www.interlopers.net/forum/viewtopic.php?t=9170",
            "https://developer.valvesoftware.com/wiki/HDR_Skybox_Creation",
            "https://developer.valvesoftware.com/wiki/HDR"
        ]
    },
    {
        "severity": "2",
        "regex": "NODRAW\\s+on\\s+terrain\\s+surface\\!\n",
        "error_short": "NODRAW on terrain surface!",
        "error_description": "You aren't allowed to have the \"tools/nodraw\" texture one a displacement.",
        "error_solution": "There are two possible causes, you accidently covered a displacement face in nodraw or you accidently made a hidden face a displacement. In order to fix it in either cases, uncheck the \"auto\" visgroup, then check only the \"displacements\" visgroup. Now, look round the map see if nodraw is anywhere you wanted a real texture. If found, open the material browser and find and replace the nodraw texture with any other texture. If there's no vibisible displacement faces with nodraw you'll probably want to destroy them. Open the material browser, check \"Only show used textures\", select NoDraw and press \"Mark\". Open up the face edit sheet, and click \"Destroy\" on the displacement tab.",
        "error_references": [
            ""
        ]
    },
    {
        "severity": "5",
        "regex": "numvertexes\\s+\\=\\=\\s+MAX_MAP_VERTS\n",
        "error_short": "numvertexes == MAX_MAP_VERTS",
        "error_description": "You have too many vertices in your map (points from which brushes are made). In other words, your map is too big or too detailed.",
        "error_solution": "Delete or simplify some of your brushes. Perhaps you can convert parts of your map into brushes, or in case of singleplayer maps, divide the map up into multiple parts with a level change?",
        "error_references": [
            "MAX_MAP_VERTS "
        ]

        "error_description": "You have too many vertices in your map. Vertices are the points from which brushes are made. The exact limit depends on your Source Engine branch, but is typically 65536.",
        "error_solution": "Reduce the number of brushes in your map. Replace brushwork with models, merge brushes together, use less complex geometry.",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Brush"
        ]
    },
    {
        "severity": "1",
        "regex": "Occluder\\s+\"([^\"]+)\"\\s+straddles\\s+multiple\\s+areas\\.\\s+This\\s+is\\s+invalid\\!\n",
        "error_short": "Occluder \"[sub:1]\" straddles multiple areas. This is invalid!",
        "error_description": "This error means you have a func_occluder (by the name of [sub:1]) that is touching an areaportal or is inside a brush that is touching two areas. (An area is a part of your map closed off by a areaportals and world-brushes)",
        "error_solution": "Move or delete the occluder or areaportal(s).",
        "error_references": [
            "https://developer.valvesoftware.com/wiki/Func_occluder"
        ]
    },
    {
        "severity": "5",
        "regex": "Overlay\\s+at\\s+([\\d\\.,-]+)\\s+([\\d\\.,-]+)\\s+([\\d\\.,-]+)\\s+has\\s+invalid\\s+render\\s+order\\s+\\(([\\d\\.,-]+)\\)\n",
        "error_short": "Overlay at [sub:1] [sub:2] [sub:3] has invalid render order ([sub:4])",
        "error_description": "A render order determines which overlays are drawn on top over the others (or under). These render orders are simple numbers, ranging from 1-3. Other numbers are invalid, causing this error.",
        "error_solution": "If this error is accompanied by insanely huge numbers, it is most likely a badly placed info_overlay (atleast it was in my case). These entities don't like to be placed on the edge of a brush. If even that is not the case, try to open the map in a texteditor and look for the numbers. They may be caused by a b0rked map, or something along those lines. I recommend to atleast try to remove said overlay (view -> go to coordinates ( [sub:1] [sub:2] [sub:3] ) and recreate it.",
        "error_references": [
            "Finding the unfindable "
        ]
    },
    {
        "severity": "5",
        "regex": "Overlay\\s+touching\\s+too\\s+many\\s+faces\\s+\\(touching\\s+([\\d\\.,-]+),\\s+max\\s+64\\)\\s+Overlay\\s+([\\w\\/\\\\_\\-\\.]+)\\s+at\\s+([\\d\\.,-]+)\\s+([\\d\\.,-]+)\\s+([\\d\\.,-]+)\n",
        "error_short": "Overlay touching too many faces (touching [sub:1], max 64) Overlay [sub:2] at [sub:3] [sub:4] [sub:5]",
        "error_description": "You have an overlay (info_overlay) entity that is touching too many brushes, or parts of a brush. The error message tells you also how much you have and allowed (touching [sub:1], max 64)",
        "error_solution": "You can find the overlay using the coordinates. View -> go to coordinates( [sub:3] [sub:4] [sub:5] ) You can delete, move or resize the overlay.",
        "error_references": [
            ""
        ]
    },
    {
        "severity": "2",
        "regex": "prop_physics\\s+at\\s+([\\d\\.,-]+)\\s+([\\d\\.,-]+)\\s+([\\d\\.,-]+)\\s+uses\\s+model\\s+([\\w\\/\\\\_\\-\\.]+),\\s+which\\s+has\\s+no\\s+propdata\\s+which\\s+means\\s+it\\s+must\\s+be\\s+used\\s+on\\s+a\\s+prop_static\\.\\s+DELETED\\.\n",
        "error_short": "prop_physics at [sub:1] [sub:2] [sub:3] uses model [sub:4], which has no propdata which means it must be used on a prop_static. DELETED.",
        "error_description": "You have used (created yourself?) a model without the data compiled in it for it to become a non-static entity. These kind of models can only be used on prop_statics, unless you recompile them with the neccesairy data.",
        "error_solution": "Find them using the coordinates, or simply recompile the model with the appropriate data",
        "error_references": [
            "Find coordinates in a mapCompiling model"
        ]
    },
    {
        "severity": "0",
        "regex": "Static\\s+prop\\s+([\\w\\/\\\\_\\-\\.]+)\\s+outside\\s+the\\s+map\\s+\\(([\\d\\.,-]+),\\s+([\\d\\.,-]+),\\s+([\\d\\.,-]+)\\)\n",
        "error_short": "Static prop [sub:1] outside the map ([sub:2], [sub:3], [sub:4])",
        "error_description": "You have a prop_static outside the map, or you have a big leak. You may also have a prop completely inside a world brush (that's the bounding box entirely inside the brush).",
        "error_solution": "Delete the entity, move the entity into your level (or turn the offending brush into a brush entity), or fix the leak.",
        "error_references": [
            "Reference: LeaksWIKI: leak"
        ]
    },
    {
        "severity": "5",
        "regex": "stylenum\\s+\\=\\=\\s+MAX_SWITCHED_LIGHTS\n",
        "error_short": "stylenum == MAX_SWITCHED_LIGHTS",
        "error_description": " You have too many (more than 32) differently named lights in your map. You can't have that many independantly switchable lights ",
        "error_solution": "Remove some lights, or give a few the same name, or remove the names of some lights.",
        "error_references": [
            ""
        ]
    },
    {
        "severity": "3",
        "regex": "Texture\\s+axis\\s+perpendicular\\s+to\\s+face\\s+at\\s+\\(([\\d\\.,-]+),\\s+([\\d\\.,-]+),\\s+([\\d\\.,-]+)\\)\n",
        "error_short": "Texture axis perpendicular to face at ([sub:1], [sub:2], [sub:3])",
        "error_description": "This is vrad's way of saying a texture (face and its corresponding luxel(lightmap)) is aligned to its face at 90 degrees. This is because the \"align\"-settings for that face are setup wrong. ",
        "error_solution": "Find the face using the coordinates. You will notice a very overstretched appearance of the texture belonging to the offending side. If you can't find it, you must select the entire brush, if you can find the exact face, just select that face in the texture application tool. When you are in the texture application tool, notice the \"align to face\" and \"align to world\" tickboxes. Try the one that isn't currently checked, or both. If they don't work, your brush is broken and needs to be repaired. Either using the vertex-tool, or deleting the brush and recreating it.",
        "error_references": [
            "Reference: Finding the location of "
        ]
    },
	{
        "severity": "3",
        "regex": "Luxel\\s+axis\\s+perpendicular\\s+to\\s+face\\s+at\\s+\\(([\\d\\.,-]+),\\s+([\\d\\.,-]+),\\s+([\\d\\.,-]+)\\)\n",
        "error_short": "Luxel axis perpendicular to face at ([sub:1], [sub:2], [sub:3])",
        "error_description": "See Texture axis perpendicular to fa",
        "error_solution": "",
        "error_references": [
            ""
        ]
    },
    {
        "severity": "0",
        "regex": "The\\s+command\\s+failed\\.\\s+Windows\\s+reported\\s+the\\s+error\\:\\s+The\\s+system\\s+cannot\\s+find\\s+the\\s+file\\s+specified\\.\n",
        "error_short": "The command failed. Windows reported the error: The system cannot find the file specified.",
        "error_description": "At the end of the compiling process the BSP file is copied from the directory your vmf file is in to the game/maps directory so it can be played. This error means it couldn't find the BSP to copy it.(the message Windows returns may vary on it's language)The cause is usually some fatal error in vbsp.exe (the program that generates the bare bsp-file) so check for other errors in your log. The other cause is some invalid setup of directories, or bad mapnames, too long pathnames etc.In which case you should also see the effects further upwards in the log (something like the other programs not being able to load your map). For mapnames, remember to avoid any strange characters, like brackets, dots, commas and spaces. try to build your mapname out of characters ( a-z ), numbers ( 0-9 ) and the underscore ( _ ) only. The exact cause is usally findable in the logfile.Remember this error is not a cause of your map to not compile, it is merely a sign that your map didn't compile.",
        "error_solution": "Check your logfile for errors, check your directory setup or rename your map.",
        "error_references": [
            "Logfile-checker (see search above) "
        ]
    },
    {
        "severity": "5",
        "regex": "The\\s+map\\s+overflows\\s+the\\s+max\\s+portal\\s+count\\s+\\(([\\d\\.,-]+)\\s+of\\s+max\\s+32768\\)\\!\\s+\n",
        "error_short": "The map overflows the max portal count ([sub:1] of max 32768)! ",
        "error_description": "Your map has too many portals. (your portals is [sub:1], the max is 32768)",
        "error_solution": "Optimize your map (tie brushes to func_detail) to reduce portals. You may even have to decrease the size of your map.",
        "error_references": [
            "Using func_detailMAX_MAP_PORTALSWIKI: Optimiza"
        ]
    },
    {
        "severity": "0",
        "regex": "Too\\s+many\\s+indices\\s+for\\s+index\\s+buffer\\.\\.\\s+tell\\s+a\\s+programmer\\s+\\(([\\d\\.,-]+)\\>32768\\)\n",
        "error_short": "Too many indices for index buffer.. tell a programmer ([sub:1]>32768)",
        "error_description": "The only time I can over this error is was caused by a func_precipitation that was too big. If you got one in your level, try to decrease its size so it sits under the max again ([sub:1] is the number you currently have, 32768 is the max). You can also try to decrease the density of the effect you were trying to make using this entity. It also seems optimizing helps. ",
        "error_solution": "",
        "error_references": [
            ""
        ]
    },
    {
        "severity": "5",
        "regex": "Too\\s+many\\s+portal\\s+verts\n",
        "error_short": "Too many portal verts",
        "error_description": "You have too many portal verts. Portals are doorways between visleafs, verts are their corner points.",
        "error_solution": "Try tying some world brushes to a func_detail. This will lower the amount of portal verts in your map by erasing some \"doors\" between world brushes. Also try deleting any unnecessary world brushes that are lying around your map.",
        "error_references": [
            "MAX_MAP_PORTALVERTSOptimize the ma"
        ]
    },
    {
        "severity": "5",
        "regex": "Too\\s+many\\s+t-junctions\\s+to\\s+fix\\s+up\\!\n",
        "error_short": "Too many t-junctions to fix up!",
        "error_description": "See h",
        "error_solution": "",
        "error_references": [
            ""
        ]
    },
    {
        "severity": "5",
        "regex": "Too\\s+many\\s+t-junctions\\s+to\\s+fix\\s+up\\!\\s+\\(([\\d\\.,-]+)\\s+prims,\\s+max\\s+([\\d\\.,-]+)\\s+\\:\\:\\s+([\\d\\.,-]+)\\s+indices,\\s+max\\s+([\\d\\.,-]+)\\)\n",
        "error_short": "Too many t-junctions to fix up! ([sub:1] prims, max [sub:2] :: [sub:3] indices, max [sub:4])",
        "error_description": "(from Jeff Lane, Valve) \"VBSP does cleanup of edges where func_detail geometry meets world geometry to avoid getting visual cracks. One of the ways it does is this by elminating t-junctions. It sounds like you may have hit a limit of the number of those cleanups in the level. ",
        "error_solution": "If that is the case, you could fix the problem by reducing the number of func_detail brushes in the level, especially ones that touch non-detail geometry. It's probably a sign that you have too much complex brush geometry in the level, and would benefit from having some of it be model geometry instead.\"It is worth noting that func_brush geometry does not perform the same fix ups on compile. Turning some of your func_detail geometry into func_brush geometry may solve this error.The error message shows you that you have [sub:1] primitives (max [sub:2] causing all of this, resulting in [sub:3] t-junctions (max [sub:4])",
        "error_references": [
            "WIKI: making models out of brushes with XSI"
        ]
    },
    {
        "severity": "0",
        "regex": "Too\\s+many\\s+verts\\s+for\\s+a\\s+dynamic\\s+vertex\\s+buffer\\s+\\(([\\d\\.,-]+)\\>32768\\)\\s+Tell\\s+a\\s+programmer\\s+to\\s+up\\s+VERTEX_BUFFER_SIZE\\.\n",
        "error_short": "Too many verts for a dynamic vertex buffer ([sub:1]>32768) Tell a programmer to up VERTEX_BUFFER_SIZE.",
        "error_description": "You have too many dynamic vertices. These are points that make up entity brushes (like func_doors). In Hammer, most lines are dynamic vertices too. (like the leakfile), but the brushes aren't (they dont move in Hammer).",
        "error_solution": "Tie as much of these entity-brushes to either world (de-entify them) or func_detail (the only, non-dynamic entity). don't be confused with hl1: func_wall should not be used to optimize your map! Instead use func_detail. Proper optimization (with the use of vvis.exe) should reduce the times you see this error. According to steampowered.com, this can also be caused by a broken cache file. A Valve programmer mentiones on the Valve Wiki that this error should only happen on mods with errors in the code, but practice has learned otherwise. (so far for their coders abilities :P ). You currently have [sub:1], and the max is 32768, so there's quite a bit to do.",
        "error_references": [
            "How to check your cache fil"
        ]
    },
    {
        "severity": "5",
        "regex": "Trying\\s+to\\s+create\\s+a\\s+non-quad\\s+displacement\\!\n",
        "error_short": "Trying to create a non-quad displacement!",
        "error_description": "lacements can only have four sides, no more, no less.",
        "error_solution": "Find your displacement (you'll have to check each one in your level) and recreate it so it has four sides again. You may need to be creative with some vertex manipulation for some shapes you want to create with displacements.",
        "error_references": [
            "Finding the unfindable "
        ]
    },
    {
        "severity": "0",
        "regex": "unexpected\\s+strips\\s+found\n",
        "error_short": "unexpected strips found",
        "error_description": "When compiling with -textureshadows this causes VRAD.exe to ignore every model.",
        "error_solution": "",
        "error_references": [
            ""
        ]
    },
    {
        "severity": "2",
        "regex": "WARNING\\:\\s+areaportal\\s+entity\\s+([\\d\\.,-]+)\\s+\\(brush\\s+([\\d\\.,-]+)\\)\\s+touches\\s+\\>\\s+2\\s+areas\n",
        "error_short": "WARNING: areaportal entity [sub:1] (brush [sub:2]) touches > 2 areas",
        "error_description": "One of your areaportals touches too many areas. The probably cause is one or more areaportals touching/intersecting each other or world brushes that seperate atleast two areas (this causes the areaportals to touch more than two areas). ",
        "error_solution": "The fix would be to move your areaportal(s) around so the above situations don't occur. You may need to read up on the usage of areaportals if you do not understand the problem. I suggest you find your areaportals using it's brushnumber ( [sub:2] )",
        "error_references": [
            "AreaportalsWIKI: Func_areaportal"
        ]
    },
    {
        "severity": "4",
        "regex": "WARNING\\:\\s+BSP\\s+node\\s+with\\s+unbounded\\s+volume\\s+\\(material\\:\\s+\\<NO\\s+BRUSH\\>,\\s+near\\s+\\(([\\d\\.,-]+),\\s+([\\d\\.,-]+),\\s+([\\d\\.,-]+)\\)\\)\n",
        "error_short": "WARNING: BSP node with unbounded volume (material: <NO BRUSH>, near ([sub:1], [sub:2], [sub:3]))",
        "error_description": "vbsp is having a hard time figuring out your level, it seems to have found a part of your level that is infinite in size. This is, offcourse, invalid",
        "error_solution": "Look near the coordinates given. It is likely that you either need to func_detail a lot of brushes in that area, or that you have an invalid brush somewhere (Alt-p in hammer to check for them). It may be pretty difficult to hunt down the exact problem though.",
        "error_references": [
            ""
        ]
    },
    {
        "severity": "3",
        "regex": "WARNING\\:\\s+Cluster\\s+portals\\s+saw\\s+into\\s+cluster\n",
        "error_short": "WARNING: Cluster portals saw into cluster",
        "error_description": "(I think) vbsp.exe has made a concave leaf (or in other ways invalid) that can see into itself. I've also heard about this being caused by overlapping brushes or brushes that are off-grid (thuss causing offgrid visleafs). Allthough i find this unlikely, I am not sure if it isn't, so keep those possibilities open too.",
        "error_solution": "The solution is to simplify your leafs (func_detail) as much as possible to avoid this error, but usually (or sometimes) you will find no bad things come from it and your map runs as it should. If you got unexpected low FPS somewhere, this may be the cause. Finding it may be hard, and usually ends up in using cordon tools or just not doing it at all. First look at complicated parts of your map, try to use glview glview to find it.",
        "error_references": [
            "how to use glviewWIKI: glview"
        ]
    },
    {
        "severity": "3",
        "regex": "Warning\\:\\s+Couldn't\\s+open\\s+texlight\\s+file\\s+lights\\.rad\n",
        "error_short": "Warning: Couldn't open texlight file lights.rad",
        "error_description": "Vrad.exe couldn't find lights.rad, a file used to determine which textures can emit light by themselves.",
        "error_solution": "Move to/make a new lights.rad in the right directory. You should search for the file in your mod's directory, most mods have one.",
        "error_references": [
            "Lights.rad tutorial"
        ]
    },
    {
        "severity": "1",
        "regex": "Warning\\:\\s+Duplication\\s+of\\s+texlight\\s+'([\\w\\/\\\\_\\-\\.]+)'\\s+in\\s+file\\s+'lights\\.rad'\\!\n",
        "error_short": "Warning: Duplication of texlight '[sub:1]' in file 'lights.rad'!",
        "error_description": "This texture was listed twice in lights.rad. the fix is obvious, but not necessairy",
        "error_solution": "Lights.rad tutorial",
        "error_references": [
            ""
        ]
    },
    {
        "severity": "2",
        "regex": "Warning\\:\\s+ignoring\\s+bad\\s+texlight\\s+'([\\w\\/\\\\_\\-\\.]+)'\\s+in\\s+lights\\.rad\n",
        "error_short": "Warning: ignoring bad texlight '[sub:1]' in lights.rad",
        "error_description": "One of the entries in lights.rad is invalid. Make sure when you edit this file you use plain text-editors, e.g. notepad, wordpad. DON'T SAVE MAKE-UP to this file as MS-Word (from office) will!",
        "error_solution": "Lights.rad tutorial",
        "error_references": [
            ""
        ]
    },
    {
        "severity": "1",
        "regex": "Warning\\:\\s+node\\s+with\\s+unbounded\\s+volume\n",
        "error_short": "Warning: node with unbounded volume",
        "error_description": "Your map has a node with an infinite size. (a node is what a clipnode was in hl1, in other words a volume denoting where the player can get to and where not.)",
        "error_solution": "Unless you just did some vertex-manipulation or placed static props in a wall, or added a funky new displacement, you shouldn't hunt this error down, as it may take you ages to find, unless you get strange effects in your map. Just fix (simplify) the awkward gemetry if you find it. May also be the sign of an invalid brush, or simply vertices offgrid (unlikely?).",
        "error_references": [
            "Reference: Finding the unfindable "
        ]
    },
    {
        "severity": "1",
        "regex": "Warning\\:\\s+node\\s+without\\s+a\\s+volume\n",
        "error_short": "Warning: node without a volume",
        "error_description": "Your map has a node without a volume. (a node is what a clipnode was in hl1, in other words a volume denoting where the player can get to and where not.)",
        "error_solution": "Unless you just did some vertex-manipulation or placed static props in a wall, or added a funky new displacement, you shouldn't hunt this error down, as it may take you ages to find, unless you get strange effects in your map. Just fix (simplify) the awkward gemetry if you find it. May also be the sign of an invalid brush, or simply vertices offgrid (unlikely?).",
        "error_references": [
            "Reference: Finding the unfindable "
        ]
    },
    {
        "severity": "2",
        "regex": "Warning\\:\\s+overflowed\\s+([\\d\\.,-]+)\\s+displacement\\s+corner-neighbor\\s+lists\\.\n",
        "error_short": "Warning: overflowed [sub:1] displacement corner-neighbor lists.",
        "error_description": "There seems to be a fixed amount of displacement-sides allowed that touch other displacements, and you seem to have reached the limit. I've seen this warning show up more and more, mostly with mappers trying to create large tracks of landscapes with lots and lots of displacements. This may be the cause of occasionally reported lighting errors, but that may not be the case in your map.",
        "error_solution": "The only (theoretically) fix i can think of is to reduce the amount of displacements touching other displacements. You *only* need to fix about [sub:1] displacements, so... I'd only fix this error if you do experience problems in your map.",
        "error_references": [
            ""
        ]
    },
    {
        "severity": "0",
        "regex": "Warning\\:\\s+Table\\s+modelprecache\\s+is\\s+full,\\s+can't\\s+add\\s+some_model\n",
        "error_short": "Warning: Table modelprecache is full, can't add some_model",
        "error_description": "Your map has too much models, this includes  weapons, players, props, bullets, gibs etc. You should seriously remove some! ",
        "error_solution": "",
        "error_references": [
            ""
        ]
    },
    {
        "severity": "3",
        "regex": "WARNING\\:\\s+Too\\s+many\\s+light\\s+styles\\s+on\\s+a\\s+face\\s+at\\s+\\(([\\d\\.,-]+),\\s+([\\d\\.,-]+),\\s+([\\d\\.,-]+)\\)\n",
        "error_short": "WARNING: Too many light styles on a face at ([sub:1], [sub:2], [sub:3])",
        "error_description": "There's a face with too many different light styles of light shining on it. (more than six). For every switchable light (that is: any light that is named or has a custom appearance) shining on a face, vrad.exe makes a new lightstyle. Basically, it calculates how the face looks like when:-light 1 is on and light 2 is off-light 1 is on and light 2 is on-light 1 is off and light 2 is off-light 1 is off and light 2 is onI'm sure you understand how 6 switchable lights make 2 ^ 6 lightstyles, and how this enormous amount of memory has to be saved somehow. and limited.",
        "error_solution": "To stop this error, remove lights, dont give the light names unless you need to, make sure certain lights dont shine on the face (max_shining distance or by blocking it with brushes) or simply dont use that much switchable lights. Dynamic lights are not used by vrad.exe thus dont count. Lights with the same names are counted as the same lights. Find the location of the error using the coordinates.",
        "error_references": [
            "Reference: Finding the cause of "
        ]
    },
    {
        "severity": "4",
        "regex": "warning\\:\\s+Vis\\s+decompression\\s+overrun\n",
        "error_short": "warning: Vis decompression overrun",
        "error_description": "I think you have hit some kind of limit in the vvis process, considering the process (vvis.exe) I suppose this is visleafs, if so, optimizing may work. You may also try to reduce the amount of props in your map, (grasses), I've heard this can help too.",
        "error_solution": "See above",
        "error_references": [
            "Optimizing tutorialHL2 WIKI Optimiza"
        ]
    },
    {
        "severity": "1",
        "regex": "zero\\s+area\\s+child\\s+patch\n",
        "error_short": "zero area child patch",
        "error_description": "A solid in your level has a face with no area. My guess is that vrad.exe is trying to create a lightmap for a face that doesn't exist. Maybe you have an invalid brush?",
        "error_solution": "First check Hammers problemchecker (alt+p). If that doesn't solve your problems, you can either ignore the error, or try to find it anyway using cordon tools. You would be looking for brushes which might be too complex. I wouldn't recommend the second option.",
        "error_references": [
            "Reference: Finding the cause of unknown "
        ]
    },
    {
        "severity": "0",
        "regex": "([\\w\\/\\\\_\\-\\.]+)\\:\\s+UTIL_SetModel\\:\\s+Not\\s+Precached\n",
        "error_short": "[sub:1]: UTIL_SetModel: Not Precached",
        "error_description": "One of your brush-based entities wasn't tied to any brushes. You probably deleted the brushes belonging to this entity with ignore groups enabled, causing the entity itself to remain. Because of this, the engine cannot precache the brushes belonging to this entity, and crashes when starting the map because no brushes are precached for this entity.",
        "error_solution": "Use entity report to find the entity and delete it. You likely need to go past every entity of this kind in your map.",
        "error_references": [
            ""
        ]
    },
    {
        "severity": "1",
        "regex": "([\\d\\.,-]+)\\s+degenerate\\s+face\\(s\\)\n",
        "error_short": "[sub:1] degenerate face(s)",
        "error_description": "A degenerate face is a face with no area. For instance, when two of its points are at the same place or three vertices on one line.  Rarely, this error can cause all the lighting in your level to become black.  If this happens, you will have to track down the degenerate face(s).  This is however rare, so only go after the face if your level turns completely dark or you experience other strange errors.",
        "error_solution": "Don't try to fix this error if you don't experience strange problems, it will take you ages to find them in your level (trial and error, most likely). You will want to examply vertex-manipulated brushes first.",
        "error_references": [
            ""
        ]
    }
]